In [141]:
import pandas as pd

# Clean Education and Earning Dataset

In [142]:
df = pd.read_csv("original databases/Education and Earnings.csv")
df.head()

,COUNTRY,Country,ISC11A,ISC11A.1,SEX,Gender,AGE,Age,EARN_CATEGORY,EARN_CATEGORY.1,...,Year,Unit Code,Unit,PowerCode Code,PowerCode,Reference Period Code,Reference Period,Value,Flag Codes,Flags
0,CZE,Czech Republic,L6,Bachelor’s or equivalent education,F,Women,Y55T64,55-64 years,PTPY_EARNERS,Part-time or part-year earners,...,Latest available year,PC,Percentage,0,Units,2018.0,2018.0,NaN,m,Missing data
1,FIN,Finland,L7T8,"Master’s, Doctoral or equivalent education",M,Men,Y25T64,25-64 years,NO_EARNINGS,No earnings,...,Latest available year,PC,Percentage,0,Units,2018.0,2018.0,7.504321,NaN,NaN
2,KOR,Korea,L5,Short-cycle tertiary education,M,Men,Y25T34,25-34 years,NO_EARNINGS,No earnings,...,Latest available year,PC,Percentage,0,Units,2019.0,2019.0,23.137910,NaN,NaN
3,NLD,Netherlands,L6,Bachelor’s or equivalent education,F,Women,Y25T64,25-64 years,FTFY_EARNERS,"Full-time, full-year earners",...,Latest available year,PC,Percentage,0,Units,2019.0,2019.0,NaN,m,Missing data
4,ESP,Spain,L5,Short-cycle tertiary education,M,Men,Y55T64,55-64 years,PTPY_EARNERS,Part-time or part-year earners,...,Latest available year,PC,Percentage,0,Units,2018.0,2018.0,16.337100,NaN,NaN

Remove redundant columns

In [143]:
df = df.drop(["ISC11A","SEX", "AGE", "EARN_CATEGORY", "Reference Period Code"], axis=1)

Remove Unnecessary Columns

In [144]:
df = df.drop(["YEAR", "INDICATOR", "Indicator", "MEASURE", "Measure", "Unit", "Year","Unit Code", "PowerCode Code","Age", "PowerCode", "Flag Codes", "Flags"],  axis=1)

df.head()

,COUNTRY,Country,ISC11A.1,Gender,EARN_CATEGORY.1,Reference Period,Value
0,CZE,Czech Republic,Bachelor’s or equivalent education,Women,Part-time or part-year earners,2018.0,NaN
1,FIN,Finland,"Master’s, Doctoral or equivalent education",Men,No earnings,2018.0,7.504321
2,KOR,Korea,Short-cycle tertiary education,Men,No earnings,2019.0,23.137910
3,NLD,Netherlands,Bachelor’s or equivalent education,Women,"Full-time, full-year earners",2019.0,NaN
4,ESP,Spain,Short-cycle tertiary education,Men,Part-time or part-year earners,2018.0,16.337100

In [150]:
df = df.dropna()
df = df.drop(df[(df["Gender"] == "Women") | (df["Gender"] == "Men")].index)
df = df.rename(columns={"COUNTRY": "Country code", "ISC11A.1": "Education Level", "Reference Period": "Year", "EARN_CATEGORY.1": "Earn category"})

In [151]:
df.head()

,Country code,Country,Education Level,Gender,Earn category,Year,Value
5,CAN,Canada,Short-cycle tertiary education,Total,"Full-time, full-year earners",2018.0,57.60789
8,ESP,Spain,Bachelor’s or equivalent education,Total,Part-time or part-year earners,2018.0,34.66573
9,SWE,Sweden,Bachelor’s or equivalent education,Total,"Full-time, full-year earners",2019.0,51.04170
10,SWE,Sweden,Short-cycle tertiary education,Total,No earnings,2019.0,12.85634
17,KOR,Korea,Short-cycle tertiary education,Total,No earnings,2019.0,49.51765

In [152]:
df.to_csv("cleaned databases/edu_earnings.csv")

# Clean Enrolment by Field

In [115]:
df = pd.read_csv("original databases/Enrolment by Field.csv")
df.head()

,COUNTRY,Country,SEX,Gender,EDUCATION_FIELD,Field,MOBILITY,International mobility,EDUCATION_LEV,Education level,YEAR,Year,Value,Flag Codes,Flags
0,AUS,Australia,M,Male,F01,Education,_T,Total,ISCED11_5,Short-cycle tertiary education,2019,2019,3496.0,NaN,NaN
1,AUS,Australia,F,Female,F01,Education,MOB,Mobile including homecoming nationals,ISCED11_5,Short-cycle tertiary education,2019,2019,4039.0,NaN,NaN
2,AUS,Australia,M,Male,F01,Education,MOB,Mobile including homecoming nationals,ISCED11_5,Short-cycle tertiary education,2019,2019,301.0,NaN,NaN
3,AUS,Australia,F,Female,F01,Education,MOB_HOME,Homecoming nationals,ISCED11_5,Short-cycle tertiary education,2019,2019,NaN,m,Missing value; data cannot exist
4,AUS,Australia,M,Male,F01,Education,_T,Total,ISCED11_6,Bachelor’s or equivalent level,2019,2019,19886.5,NaN,NaN

Remove columns with redundant data

In [116]:
df = df.drop(["SEX", "EDUCATION_FIELD", "YEAR"], axis=1)

Remove columns with Unnecessary data

In [117]:
df = df.drop(["MOBILITY", "EDUCATION_LEV", "Flag Codes", "Flags", "Year"], axis=1)

Remove rows with NAN values

In [118]:
df = df.dropna()
df = df.rename(columns={"COUNTRY": "Country code"})

In [119]:
df

,Country code,Country,Gender,Field,International mobility,Education level,Value
0,AUS,Australia,Male,Education,Total,Short-cycle tertiary education,3496.000
1,AUS,Australia,Female,Education,Mobile including homecoming nationals,Short-cycle tertiary education,4039.000
2,AUS,Australia,Male,Education,Mobile including homecoming nationals,Short-cycle tertiary education,301.000
4,AUS,Australia,Male,Education,Total,Bachelor’s or equivalent level,19886.500
5,AUS,Australia,Female,Education,Mobile including homecoming nationals,Bachelor’s or equivalent level,3616.138
...,...,...,...,...,...,...,...
9353,KOR,Korea,Female,"Natural sciences, mathematics and statistics",Mobile including homecoming nationals,Bachelor’s or equivalent level,412.000
9354,NOR,Norway,Male,"Agriculture, forestry, fisheries and veterinary",Total,Master’s or equivalent level,238.000
9357,LVA,Latvia,Male,Information and Communication Technologies (ICTs),Total,Doctoral or equivalent level,78.000
9358,DNK,Denmark,Male,"Natural sciences, mathematics and statistics",Homecoming nationals,Doctoral or equivalent level,9.000
9359,JPN,Japan,Female,Education,Mobile including homecoming nationals,Master’s or equivalent level,667.000

In [120]:
df.to_csv("cleaned databases/enroll_field.csv")

# Clean Enrolment by type of Institution Dataset

In [165]:
df = pd.read_csv("original databases/Enrolment by type of Institution.csv")
df.head()

,COUNTRY,Country,SEX,Gender,REF_SECTOR,Reference sector,INTENSITY,Intensity,EDUCATION_LEV,Education level,UNIT_MEASURE,Unit,YEAR,Year,Value,Flag Codes,Flags
0,AUS,Australia,_T,Total,INST_PUB,Public educational institutions,_T,Full- and part-time,ISCED11_5,Short-cycle tertiary education,PN,Pure number,2013,2013,166673.0,NaN,NaN
1,AUS,Australia,_T,Total,INST_PUB,Public educational institutions,_T,Full- and part-time,ISCED11_5,Short-cycle tertiary education,PN,Pure number,2014,2014,172519.0,NaN,NaN
2,AUS,Australia,_T,Total,INST_PUB,Public educational institutions,_T,Full- and part-time,ISCED11_5,Short-cycle tertiary education,PN,Pure number,2015,2015,401223.0,NaN,NaN
3,AUS,Australia,_T,Total,INST_PUB,Public educational institutions,_T,Full- and part-time,ISCED11_5,Short-cycle tertiary education,PN,Pure number,2016,2016,383699.0,NaN,NaN
4,AUS,Australia,_T,Total,INST_PUB,Public educational institutions,_T,Full- and part-time,ISCED11_5,Short-cycle tertiary education,PN,Pure number,2017,2017,296421.0,NaN,NaN

Remove columns with unnecessary data

In [166]:
df = df.drop(["SEX", "Gender","UNIT_MEASURE", "Unit", "Flag Codes", "Flags"], axis=1)

Remove columns with redundant data

In [167]:
df = df.drop(["REF_SECTOR", "INTENSITY", "EDUCATION_LEV", "YEAR"], axis=1)

Remove rows with NAN values

In [168]:
df = df.dropna()
df = df.drop(df[(df["Intensity"] == "Full- and part-time")].index)
df = df.rename(columns={"COUNTRY": "Country code", "Intensity": "Employment type"})

In [169]:
df.head()

,Country code,Country,Reference sector,Employment type,Education level,Year,Value
21,AUS,Australia,Public educational institutions,Full-time,Short-cycle tertiary education,2013,73725.0
22,AUS,Australia,Public educational institutions,Full-time,Short-cycle tertiary education,2014,78265.0
23,AUS,Australia,Public educational institutions,Full-time,Short-cycle tertiary education,2015,99335.0
24,AUS,Australia,Public educational institutions,Full-time,Short-cycle tertiary education,2016,111055.0
25,AUS,Australia,Public educational institutions,Full-time,Short-cycle tertiary education,2017,92143.0

In [170]:
df.to_csv("cleaned databases/enroll_institution_type.csv")

TESTING

In [157]:
df1 = pd.read_csv("cleaned databases/edu_earnings.csv")
earnType_db = df1[["Country code", "Education Level", "Earn category", "Year", "Value"]]
earnType_db

,Country code,Education Level,Earn category,Year,Value
0,CAN,Short-cycle tertiary education,"Full-time, full-year earners",2018.0,57.607890
1,ESP,Bachelor’s or equivalent education,Part-time or part-year earners,2018.0,34.665730
2,SWE,Bachelor’s or equivalent education,"Full-time, full-year earners",2019.0,51.041700
3,SWE,Short-cycle tertiary education,No earnings,2019.0,12.856340
4,KOR,Short-cycle tertiary education,No earnings,2019.0,49.517650
...,...,...,...,...,...
564,LVA,Short-cycle tertiary education,No earnings,2019.0,9.500000
565,LVA,"Master’s, Doctoral or equivalent education",No earnings,2019.0,17.363140
566,LVA,Short-cycle tertiary education,"Full-time, full-year earners",2019.0,78.018070
567,DEU,"Master’s, Doctoral or equivalent education",Part-time or part-year earners,2019.0,36.296970
568,LVA,"Master’s, Doctoral or equivalent education",Part-time or part-year earners,2019.0,2.494331

In [134]:
df2 = pd.read_csv("cleaned databases/enroll_field.csv")
fieldStudy_db = df2.groupby(["Country code", "Field", "International mobility", "Education level"])["Value"].sum().reset_index(name='Value')
fieldStudy_db

,Country code,Field,International mobility,Education level,Value
0,AUS,"Agriculture, forestry, fisheries and veterinary",Mobile including homecoming nationals,Bachelor’s or equivalent level,1110.815
1,AUS,"Agriculture, forestry, fisheries and veterinary",Mobile including homecoming nationals,Doctoral or equivalent level,857.000
2,AUS,"Agriculture, forestry, fisheries and veterinary",Mobile including homecoming nationals,Master’s or equivalent level,995.013
3,AUS,"Agriculture, forestry, fisheries and veterinary",Mobile including homecoming nationals,Short-cycle tertiary education,211.000
4,AUS,"Agriculture, forestry, fisheries and veterinary",Total,Bachelor’s or equivalent level,8213.369
...,...,...,...,...,...
3473,TUR,"Social sciences, journalism and information",Mobile including homecoming nationals,Short-cycle tertiary education,114.000
3474,TUR,"Social sciences, journalism and information",Total,Bachelor’s or equivalent level,690037.000
3475,TUR,"Social sciences, journalism and information",Total,Doctoral or equivalent level,9939.000
3476,TUR,"Social sciences, journalism and information",Total,Master’s or equivalent level,43045.000
3477,TUR,"Social sciences, journalism and information",Total,Short-cycle tertiary education,28668.000

In [ ]:
# create the gender db
    gender_db = df1.groupby(["COUNTRY", "Gender"])["Value"].sum()
    query = "Insert into Gender values (%s, %s, %s)"

    for index, tuple in gender_db.iterrows():
        param = [tuple["Country"], tuple["Gender"], tuple["Value"]]
        add_data(db_conn, query, param)

In [174]:
df3 = pd.read_csv("cleaned databases/enroll_institution_type.csv")
institution_db = df3[
        [
            "Country code",
            "Education level",
            "Reference sector",
            "Employment type",
            "Year",
            "Value",
        ]
    ]
institution_db

,Country code,Education level,Reference sector,Employment type,Year,Value
0,AUS,Short-cycle tertiary education,Public educational institutions,Full-time,2013,73725.0
1,AUS,Short-cycle tertiary education,Public educational institutions,Full-time,2014,78265.0
2,AUS,Short-cycle tertiary education,Public educational institutions,Full-time,2015,99335.0
3,AUS,Short-cycle tertiary education,Public educational institutions,Full-time,2016,111055.0
4,AUS,Short-cycle tertiary education,Public educational institutions,Full-time,2017,92143.0
...,...,...,...,...,...,...
4581,DNK,Master’s or equivalent level,Independent private educational institutions,Full-time,2015,0.0
4582,DNK,Master’s or equivalent level,Independent private educational institutions,Full-time,2016,0.0
4583,DNK,Master’s or equivalent level,Independent private educational institutions,Full-time,2017,0.0
4584,DNK,Master’s or equivalent level,Independent private educational institutions,Full-time,2018,0.0
4585,DNK,Master’s or equivalent level,Independent private educational institutions,Full-time,2019,0.0